In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import sidetable

plt.rcParams["figure.figsize"] = (10,8)
pd.options.display.max_columns = None

In [2]:
df = pd.read_csv('../datos/df_bank_clean', index_col = 0)

In [3]:
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
26427,31,entrepreneur,single,high.school,0.0,0.0,0.0,cellular,290,1,999,0,nonexistent,-0.1,93.200,-42.0,4.076,5195.8,no,"['nov', 'thu']"
14459,42,self-employed,divorced,basic.6y,NaN,1.0,0.0,cellular,94,3,999,0,nonexistent,1.4,93.918,-42.7,4.961,5228.1,no,"['jul', 'tue']"
17317,54,technician,married,professional.course,0.0,0.0,1.0,telephone,395,6,999,0,nonexistent,1.4,93.918,-42.7,4.962,5228.1,no,"['jul', 'fri']"

1- Columnas loan, housing y default: estas columnas contienen valores únicos de 0 y 1. Esto puede parecer poco intuitivo a la hora de la extracción de conclusiones y en las visualizaciones. 
- El objetivo de este ejercicio es que cambies los valores númericos por "Si" y "No". A que corresponde cada uno de los valores lo tenéis en el pair de Limpieza I.

In [4]:
'''
def yes_no(x):
    if x == 0:
        return 'no'
    elif x == 1:
        return 'yes'
    else:
        return x
'''

"\ndef yes_no(x):\n    if x == 0:\n        return 'no'\n    elif x == 1:\n        return 'yes'\n    else:\n        return x\n"

In [5]:
mapa = {0 : 'no', 1 : 'yes'}

In [6]:
for col in ['loan', 'housing', 'default']:
    df[col] = df[col].map(mapa, na_action="ignore")

In [7]:
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
23697,37,admin.,married,university.degree,no,yes,no,cellular,54,5,999,0,nonexistent,1.4,93.444,-36.1,4.962,5228.1,no,"['aug', 'thu']"
9766,35,blue-collar,married,basic.9y,NaN,no,no,telephone,579,4,999,0,nonexistent,1.4,94.465,-41.8,4.961,5228.1,no,"['jun', 'mon']"
38721,30,admin.,single,university.degree,no,no,no,cellular,266,2,999,2,failure,-3.4,92.649,-30.1,0.715,5017.5,yes,"['nov', 'tue']"

2- Para la columna de education, si nos fijamos en sus valores únicos veremos que tenemos puntos. 
- El objetivo de este ejercicio es que quitéis los puntos de esos valores y los reemplacéis por espacios.

In [8]:
df['education'] =df['education'].str.replace('.',' ')

/tmp/ipykernel_2080/3911354374.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['education'] =df['education'].str.replace('.',' ')

In [9]:
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
4868,30,technician,married,professional course,no,yes,no,telephone,265,1,999,0,nonexistent,1.1,93.994,-36.4,4.858,5191.0,no,"['may', 'wed']"
30534,35,services,married,high school,no,no,no,cellular,130,3,999,1,failure,-1.8,92.893,-46.2,1.354,5099.1,no,"['may', 'mon']"
31099,39,blue-collar,married,basic 9y,NaN,no,yes,cellular,343,3,999,1,failure,-1.8,92.893,-46.2,1.334,5099.1,no,"['may', 'wed']"

3- Para la columna job, hay un valor único que esta abreviado (admin.), cambiad la abreviatura por el nombre completo.

In [10]:
df['job'].unique()

array(['housemaid', 'services', 'admin.', 'blue-collar', 'technician',
       'retired', 'management', 'unemployed', 'self-employed', nan,
       'entrepreneur', 'student'], dtype=object)

In [11]:
df['job'] =df['job'].str.replace('admin.','administration', regex = True)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
9778,41,unemployed,married,basic 9y,NaN,yes,no,telephone,80,3,999,0,nonexistent,1.4,94.465,-41.8,4.961,5228.1,no,"['jun', 'mon']"
10241,31,blue-collar,single,high school,no,yes,yes,telephone,325,3,999,0,nonexistent,1.4,94.465,-41.8,4.960,5228.1,no,"['jun', 'mon']"
35418,25,student,single,high school,no,yes,no,cellular,59,2,999,0,nonexistent,-1.8,92.893,-46.2,1.244,5099.1,no,"['may', 'mon']"

In [12]:
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
22928,47,technician,married,high school,NaN,yes,yes,cellular,89,2,999,0,nonexistent,1.4,93.444,-36.1,4.965,5228.1,no,"['aug', 'mon']"
26513,30,administration,single,university degree,no,no,no,cellular,85,1,999,1,failure,-0.1,93.200,-42.0,4.076,5195.8,no,"['nov', 'thu']"
33747,28,blue-collar,single,high school,no,yes,no,cellular,516,1,999,0,nonexistent,-1.8,92.893,-46.2,1.281,5099.1,yes,"['may', 'wed']"

4- La columna month_day_week tiene una lista que contiene información muy diferente. 
- El objetivo de este ejercicio es separar esta columna en dos nuevas, donde tengamos los meses en una columna y los días de la semana en otra.

In [28]:
df['month_day_week'].unique()

array(["['may', 'mon']", "['may', 'tue']", "['may', 'wed']",
       "['may', 'thu']", "['may', 'fri']", "['jun', 'mon']",
       "['jun', 'tue']", "['jun', 'wed']", "['jun', 'thu']",
       "['jun', 'fri']", "['jul', 'tue']", "['jul', 'wed']",
       "['jul', 'thu']", "['jul', 'fri']", "['jul', 'mon']",
       "['aug', 'mon']", "['aug', 'tue']", "['aug', 'wed']",
       "['aug', 'thu']", "['aug', 'fri']", "['oct', 'fri']",
       "['oct', 'mon']", "['oct', 'tue']", "['oct', 'wed']",
       "['oct', 'thu']", "['nov', 'mon']", "['nov', 'tue']",
       "['nov', 'wed']", "['nov', 'thu']", "['nov', 'fri']",
       "['dec', 'mon']", "['dec', 'wed']", "['dec', 'thu']",
       "['dec', 'fri']", "['dec', 'tue']", "['mar', 'mon']",
       "['mar', 'tue']", "['mar', 'wed']", "['mar', 'thu']",
       "['mar', 'fri']", "['apr', 'wed']", "['apr', 'thu']",
       "['apr', 'fri']", "['apr', 'mon']", "['apr', 'tue']",
       "['sep', 'tue']", "['sep', 'wed']", "['sep', 'thu']",
       "['sep', 'fri']", "['sep', 'mon']"], dtype=object)

In [40]:
# hacemos 3 replaces eliminando los elementos que nos sobran = "[" , "]" ,"'"
df['month_day_week'] = df['month_day_week'].str.replace("'", "")
df['month_day_week']

0        may, mon
1        may, mon
2        may, mon
3        may, mon
4        may, mon
           ...
41183    nov, fri
41184    nov, fri
41185    nov, fri
41186    nov, fri
41187    nov, fri
Name: month_day_week, Length: 41176, dtype: object

In [41]:
df[['month', 'day_week']] = df['month_day_week'].str.split(',', expand = True, n = 1)

In [42]:
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
18043,29,administration,single,high school,no,no,no,telephone,38,1,999,0,nonexistent,1.4,93.918,-42.7,4.963,5228.1,no,"jul, wed",jul,wed
28436,40,services,married,basic 6y,NaN,no,no,cellular,140,2,999,2,failure,-1.8,93.075,-47.1,1.435,5099.1,no,"apr, thu",apr,thu
2691,48,administration,married,university degree,no,yes,yes,telephone,160,1,999,0,nonexistent,1.1,93.994,-36.4,4.859,5191.0,no,"may, wed",may,wed

5- Guarda el csv con las columnas limpias para seguir trabajando con este dataframe limpio.

In [44]:
df.to_csv('../datos/df_bank_clean2.csv')